# 6.Написать программу вычисления значения функции y = sin(a). (Класс Math).
# https://docs.python.org/3/library/math.html

import math
a=90
print(math.sin(a))