# 8.Вывести на экран числа от -N до N
a=float(input('Введите число: '))
count=-a
while count!=a+1 :
    print(count)
    count=count+1