# 9.Вывести на экран четные числа от 1 до N

a=float(input('Введите число: '))
count=1
while count!=a+1 :
    print(count)
    count=count+1