# 10.Вывести на экран последнюю цифру целого числа введенного с клавиатуры.
a=int(input('Введите число: '))
b=a%10
print(b)